levelup.org
#+TITLE: How To Level Up
#+AUTHOR: Nathan Yong <u5355375@anu.edu.au>
#+OPTIONS: toc:nil num:nil

\( \newcommand{\norm}[1]{\lVert #1 \rVert}
   \newcommand{\abs}[1]{\lvert #1 \rvert}
\)

Don't pay attention to the number values. They're liable to change at any time.

* Prelude

** Introduction
\label{intro}

Pierre Portal, my first year Calculus/Analysis lecturer, described understanding
mathematics in several levels, from zero to three.

- Level Zero: you fell asleep in the lecture, and know nothing.
- Level One: you know the formulas, and can apply them to examples.
- Level Two: you understand the formula, and have an intuition of why it
  works. You might be able to extend your knowledge of the formula to a related
  use case.
- Level Three: you understand the formula from a mathematical level, and you can
  prove it. You might be able to extend your knowledge of the formula to derive
  more complicated proofs and properties of mathematical objects you know
  about.

That's the title of this book explained. Introductory mathematics courses might
teach content at Level 1 or Level 2. High achieving high school
mathematics students might wish to understand content at Level 2. But in order
to get to serious concepts in maths, it becomes increasingly necessary to
understand at Level 3. This book is, then, an attempt to help you 'level up'.

This book probably won't help you. Pierre is probably totally correct, and you
need to really stare at the problems hard until you just get them. Nevertheless,
this book is an attempt at understanding proof.

** Sources
\label{sources}

For this book I have drawn on a variety of sources, including:

- Spivak's "Calculus"
- Trench's "Introduction to Real Analysis"
- Axler's "Linear Algebra Done Right"
- Lay's "Linear Algebra and its Applications"
- Beezer's "A First Course in Linear Algebra"
- Pierre Portal's own Calculus notes for 2013

* TODO Basics of Number Theory
\label{number-theory}

Before we can understand how functions of numbers work, we must first understand numbers.

* TODO Sequences and Series

To be continued...

* TODO Single-variable calculus in one dimension (The Basics)
What is calculus, and why do we study it?

The mathematical areas of study that most people mean when they say "calculus"
are the integral and differential calculus: the study of how functions change
and the areas of functions.

** TODO Continuity in one dimension
\label{continuity}

** TODO Limits in one dimension

** TODO Differential Calculus in one dimension

** TODO Integral Calculus in one dimension

** TODO Intermediate Value Theorem in one dimension
\label{ivt}

** TODO Mean Value Theorem in one dimension
\label{mvt}

** TODO Generalised Mean Value Theorem in one dimension
\label{gmvt}

* TODO Single-variable calculus in multiple dimensions ($\mathbb{R} \to \mathbb{R}^n$)
\label{one-to-many-calculus}

One-variable calculus in multiple dimensions is not particularly
terrifying. From Linear Algebra, we already know that a function from
$\mathbb{R} \to \mathbb{R}^n$ will have a one-dimensional column space and a
very large null space, so there is really only one dimension of information we
need to work with.

It may be beneficial to treat multi-dimensional real numbers as vectors, or
tuples of numbers.

** Norm and properties of numbers in $\mathbb{R}^n$
Requires: \nameref{number-theory}, \nameref{vectors}

We need a property of distance in multi-dimensional space, or a vector
space. The one we shall use for this section is the standard Euclidean norm,
which is a generalisation of the one-dimensional absolute value. We denote the
norm of a vector as such:
\[\forall (x_1, \dots, x_n) \in \mathbb{R}^n \quad
  \norm{(x_1, \dots, x_n)} := \left(\sum_{j=1}^n x_j^2\right)^{1/2}
\]

That is to say, the norm of a vector is defined as the square root of the sum
the squares of its individual components.

The important thing to note is that the norm has the property that whenever two
points are together in multi-dimensional space (their coordinates are close to
each other), then we have that the norm of their difference will be small.

** TODO Continuity ($\mathbb{R} \to \mathbb{R}^n$)
\label{one-to-many-continuity}

Recall \nameref{continuity}. A function $f: \mathbb{R} \to \mathbb{R}^n$ has
continuity defined similarly, since we only have to track one input variable. It
is continuous at point $t \in \mathbb{R}$ if:

\[ \forall \epsilon > 0,\ \exists \delta > 0,\ |h| < \delta \Rightarrow
   \norm{f(t+h) - f(t)} < \epsilon
\]

That is to say, for any error ($\epsilon$), there is a difference such that
whenever we shift the input of the function by an amount ($h$) smaller than that
distance ($\delta$), our function error will be smaller. We can always move
closer and closer to our point, with the error decreasing.

What does the second term mean, specifically?

** TODO Differential Calculus ($\mathbb{R} \to \mathbb{R}^n$)
\label{one-to-many-differential}

** TODO Integral Calculus ($\mathbb{R} \to \mathbb{R}^n$)
\label{one-to-many-integral}
