levelup.html
<!DOCTYPE html>
<html>
<head>
<title>How To Level Up</title>
<!-- 2013-10-19 Sat 00:25 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Nathan Yong &lt;u5355375@anu.edu.au&gt;">
<link rel="stylesheet" href="/static/style.css" type="text/css">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="preamble" class="status">
Hello hello moshi moshi ciao ciao busy busy
</div>
<div id="content">
<h1 class="title">How To Level Up</h1>
<p>
\( \newcommand{\norm}[1]{\lVert #1 \rVert}
   \newcommand{\abs}[1]{\lvert #1 \rvert}
\)
</p>

<p>
Don't pay attention to the number values. They're liable to change at any time.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Prelude</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
\label{intro}
</p>

<p>
Pierre Portal, my first year Calculus/Analysis lecturer, described understanding
mathematics in several levels, from zero to three.
</p>

<ul class="org-ul">
<li>Level Zero: you fell asleep in the lecture, and know nothing.
</li>
<li>Level One: you know the formulas, and can apply them to examples.
</li>
<li>Level Two: you understand the formula, and have an intuition of why it
works. You might be able to extend your knowledge of the formula to a related
use case.
</li>
<li>Level Three: you understand the formula from a mathematical level, and you can
prove it. You might be able to extend your knowledge of the formula to derive
more complicated proofs and properties of mathematical objects you know
about.
</li>
</ul>

<p>
That's the title of this book explained. Introductory mathematics courses might
teach content at Level 1 or Level 2. High achieving high school
mathematics students might wish to understand content at Level 2. But in order
to get to serious concepts in maths, it becomes increasingly necessary to
understand at Level 3. This book is, then, an attempt to help you 'level up'.
</p>

<p>
This book probably won't help you. Pierre is probably totally correct, and you
need to really stare at the problems hard until you just get them. Nevertheless,
this book is an attempt at understanding proof.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Sources</h3>
<div class="outline-text-3" id="text-1-2">
<p>
\label{sources}
</p>

<p>
For this book I have drawn on a variety of sources, including:
</p>

<ul class="org-ul">
<li>Spivak's "Calculus"
</li>
<li>Trench's "Introduction to Real Analysis"
</li>
<li>Axler's "Linear Algebra Done Right"
</li>
<li>Lay's "Linear Algebra and its Applications"
</li>
<li>Beezer's "A First Course in Linear Algebra"
</li>
<li>Pierre Portal's own Calculus notes for 2013
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="todo TODO">TODO</span> Basics of Number Theory</h2>
<div class="outline-text-2" id="text-2">
<p>
\label{number-theory}
</p>

<p>
Before we can understand how functions of numbers work, we must first understand numbers.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="todo TODO">TODO</span> Sequences and Series</h2>
<div class="outline-text-2" id="text-3">
<p>
To be continued&#x2026;
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="todo TODO">TODO</span> Single-variable calculus in one dimension (The Basics)</h2>
<div class="outline-text-2" id="text-4">
<p>
What is calculus, and why do we study it?
</p>

<p>
The mathematical areas of study that most people mean when they say "calculus"
are the integral and differential calculus: the study of how functions change
and the areas of functions.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="todo TODO">TODO</span> Continuity in one dimension</h3>
<div class="outline-text-3" id="text-4-1">
<p>
\label{continuity}
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="todo TODO">TODO</span> Limits in one dimension</h3>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="todo TODO">TODO</span> Differential Calculus in one dimension</h3>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="todo TODO">TODO</span> Integral Calculus in one dimension</h3>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="todo TODO">TODO</span> Intermediate Value Theorem in one dimension</h3>
<div class="outline-text-3" id="text-4-5">
<p>
\label{ivt}
</p>
</div>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="todo TODO">TODO</span> Mean Value Theorem in one dimension</h3>
<div class="outline-text-3" id="text-4-6">
<p>
\label{mvt}
</p>
</div>
</div>
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="todo TODO">TODO</span> Generalised Mean Value Theorem in one dimension</h3>
<div class="outline-text-3" id="text-4-7">
<p>
\label{gmvt}
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="todo TODO">TODO</span> Single-variable calculus in multiple dimensions (\(\mathbb{R} \to \mathbb{R}^n\))</h2>
<div class="outline-text-2" id="text-5">
<p>
\label{one-to-many-calculus}
</p>

<p>
One-variable calculus in multiple dimensions is not particularly
terrifying. From Linear Algebra, we already know that a function from
\(\mathbb{R} \to \mathbb{R}^n\) will have a one-dimensional column space and a
very large null space, so there is really only one dimension of information we
need to work with.
</p>

<p>
It may be beneficial to treat multi-dimensional real numbers as vectors, or
tuples of numbers.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Norm and properties of numbers in \(\mathbb{R}^n\)</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Requires: \nameref{number-theory}, \nameref{vectors}
</p>

<p>
We need a property of distance in multi-dimensional space, or a vector
space. The one we shall use for this section is the standard Euclidean norm,
which is a generalisation of the one-dimensional absolute value. We denote the
norm of a vector as such:
\[\forall (x_1, \dots, x_n) \in \mathbb{R}^n \quad
  \norm{(x_1, \dots, x_n)} := \left(\sum_{j=1}^n x_j^2\right)^{1/2}
\]
</p>

<p>
That is to say, the norm of a vector is defined as the square root of the sum
the squares of its individual components.
</p>

<p>
The important thing to note is that the norm has the property that whenever two
points are together in multi-dimensional space (their coordinates are close to
each other), then we have that the norm of their difference will be small.
</p>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="todo TODO">TODO</span> Continuity (\(\mathbb{R} \to \mathbb{R}^n\))</h3>
<div class="outline-text-3" id="text-5-2">
<p>
\label{one-to-many-continuity}
</p>

<p>
Recall \nameref{continuity}. A function \(f: \mathbb{R} \to \mathbb{R}^n\) has
continuity defined similarly, since we only have to track one input variable. It
is continuous at point \(t \in \mathbb{R}\) if:
</p>

<p>
\[ \forall \epsilon > 0,\ \exists \delta > 0,\ |h| < \delta \Rightarrow
   \norm{f(t+h) - f(t)} < \epsilon
\]
</p>

<p>
That is to say, for any error (\(\epsilon\)), there is a difference such that
whenever we shift the input of the function by an amount (\(h\)) smaller than that
distance (\(\delta\)), our function error will be smaller. We can always move
closer and closer to our point, with the error decreasing.
</p>

<p>
What does the second term mean, specifically?
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="todo TODO">TODO</span> Differential Calculus (\(\mathbb{R} \to \mathbb{R}^n\))</h3>
<div class="outline-text-3" id="text-5-3">
<p>
\label{one-to-many-differential}
</p>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="todo TODO">TODO</span> Integral Calculus (\(\mathbb{R} \to \mathbb{R}^n\))</h3>
<div class="outline-text-3" id="text-5-4">
<p>
\label{one-to-many-integral}
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Copyright &copy; 2013 Nathan Yong
</div>
</body>
</html>
